Catalogs/ДоговорыСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДоговорыСтрахования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСтрахования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСтрахования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяРасширенияПрограмм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигДатыПрикрепления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУдержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУдержания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУдержанияМедицинскогоСтрахованияСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удержание</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдерживатьЗаСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдерживатьЗаРодственников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяЧастичноеУдержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЧастичногоУдержания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрограммыМедицинскогоСтрахования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Программа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрограммыМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалаВозрастаДляСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалаВозрастаДляРодственников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикУдержаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МесяцУдержания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцУдержанияСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправляемыеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сведение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДанныеЗастрахованных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПроверкиЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправляемаяКонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПроверкиЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправляемыеДополнительныеРеквизитыИСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сведение</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПроверкиЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АдресаРассылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасширенияПрограммМедицинскогоСтрахования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасширениеСтрахования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РасширенияПрограммМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыУдержанияМедицинскогоСтрахованияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыУдержанияМедицинскогоСтрахованияСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единовременно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежемесячно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрафику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПроверять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводитьПредупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдаватьОшибку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПрограммыМедицинскогоСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПрограммыМедицинскогоСтрахования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяПремияСотрудника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяПремияРодственника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДоговорыСтрахования/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьДополнительныеРеквизитыИСведения = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения");
	СвойстваДоступны = УправлениеСвойствами.СвойстваДоступны();
	
	ИспользуютсяУдержания = ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаНастройкиУдержания", "Видимость", ИспользуютсяУдержания);
	
	ПриПолученииДанныхНаСервере();
	
	Если Не ИспользоватьДополнительныеРеквизитыИСведения Или Не СвойстваДоступны Тогда
		Элементы.ОтправляемыеДополнительныеРеквизитыИСведения.Видимость = Ложь;
	КонецЕсли;
	
	Если ИспользоватьДополнительныеРеквизитыИСведения И СвойстваДоступны Тогда
		Элементы.ПояснениеДополнительныеРеквизитыИСведения.Видимость = ?(СвойстваФизическихЛиц.Количество() > 0, Ложь, Истина);
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "ПрограммыМедицинскогоСтрахованияОбработкаВыбораЗавершение" Тогда
		Если Параметр <> Неопределено Тогда
			Объект.ПрограммыМедицинскогоСтрахования.Очистить();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(Объект.ПрограммыМедицинскогоСтрахования, Параметр, "Программа");
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "РасширенияСтрахованияОбработкаВыбораЗавершение" Тогда
		Если Параметр <> Неопределено Тогда
			Объект.РасширенияПрограммМедицинскогоСтрахования.Очистить();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(Объект.РасширенияПрограммМедицинскогоСтрахования, Параметр, "РасширениеСтрахования");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТребуетсяУдержаниеПриИзменении(Элемент)
	
	УстановитьВидимостьНастроекУдержания(ЭтотОбъект, ОбщегоНазначенияКлиент);
	
	Если ЗначениеЗаполнено(Объект.СпособУдержания) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Ежемесячно");
	
КонецПроцедуры

&НаКлиенте
Процедура СпособУдержанияМедицинскогоСтрахованияПриИзменении(Элемент)
	УстановитьВидимостьНастроекУдержания(ЭтотОбъект, ОбщегоНазначенияКлиент);
КонецПроцедуры

&НаКлиенте
Процедура ПрименяетсяЧастичноеУдержаниеПриИзменении(Элемент)
	УстановитьВидимостьНастроекЧастичногоУдержания(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИспользуютсяРасширенияПрограммПриИзменении(Элемент)
	
	УстановитьВидимостьРасширенияСтрахования();
	Если Не Объект.ИспользуютсяРасширенияПрограмм Тогда
		Объект.РасширенияПрограммМедицинскогоСтрахования.Очистить();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	Объект.ПрограммыМедицинскогоСтрахования.Очистить();
	Объект.РасширенияПрограммМедицинскогоСтрахования.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалаВозрастаДляСотрудников

&НаКлиенте
Процедура ШкалаВозрастаДляСотрудниковПослеУдаления(Элемент)
	
	ДобавитьСтрокиШкалыВозраста(Объект.ШкалаВозрастаДляСотрудников);
	СкорректироватьИнтервалыШкалыВозраста(Объект.ШкалаВозрастаДляСотрудников);
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаДляСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	УпорядочитьСтрокиШкалыВозраста(Элемент.ТекущиеДанные, Объект.ШкалаВозрастаДляСотрудников);
	СкорректироватьСоседниеСтрокиШкалыВозраста(Элемент.ТекущиеДанные, Объект.ШкалаВозрастаДляСотрудников);
	ДобавитьСтрокиШкалыВозраста(Объект.ШкалаВозрастаДляСотрудников);
	СкорректироватьИнтервалыШкалыВозраста(Объект.ШкалаВозрастаДляСотрудников);
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаДляСотрудниковЗначениеОтПриИзменении(Элемент)
	СформироватьПредставлениеИнтервалаШкалыВозраста(Объект.ШкалаВозрастаДляСотрудников);
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаДляСотрудниковЗначениеДоПриИзменении(Элемент)
	СформироватьПредставлениеИнтервалаШкалыВозраста(Объект.ШкалаВозрастаДляСотрудников);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалаВозрастаДляРодственников

&НаКлиенте
Процедура ШкалаВозрастаДляРодственниковПослеУдаления(Элемент)
	
	ДобавитьСтрокиШкалыВозраста(Объект.ШкалаВозрастаДляРодственников);
	СкорректироватьИнтервалыШкалыВозраста(Объект.ШкалаВозрастаДляРодственников);
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаДляРодственниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	УпорядочитьСтрокиШкалыВозраста(Элемент.ТекущиеДанные, Объект.ШкалаВозрастаДляРодственников);
	СкорректироватьСоседниеСтрокиШкалыВозраста(Элемент.ТекущиеДанные, Объект.ШкалаВозрастаДляРодственников);
	ДобавитьСтрокиШкалыВозраста(Объект.ШкалаВозрастаДляРодственников);
	СкорректироватьИнтервалыШкалыВозраста(Объект.ШкалаВозрастаДляРодственников);
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаДляРодственниковЗначениеОтПриИзменении(Элемент)
	СформироватьПредставлениеИнтервалаШкалыВозраста(Объект.ШкалаВозрастаДляРодственников);
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаДляРодственниковЗначениеДоПриИзменении(Элемент)
	СформироватьПредставлениеИнтервалаШкалыВозраста(Объект.ШкалаВозрастаДляРодственников);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрафикУдержаний

&НаКлиенте
Процедура ГрафикУдержанийМесяцУдержанияСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект,
		"Элементы.ГрафикУдержаний.ТекущиеДанные.МесяцУдержания", "Элементы.ГрафикУдержаний.ТекущиеДанные.МесяцУдержанияСтрокой");
	
	Объект.ГрафикУдержаний.Сортировать("МесяцУдержания");
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийМесяцУдержанияСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийМесяцУдержанияСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВводМесяцаУдержанияНачалоВыбораЗавершение", ЭтотОбъект);
	
	//@skip-check invocation-parameter-type-intersect
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", 
		Новый Структура("Значение,РежимВыбораПериода,ЗапрашиватьРежимВыбораПериодаУВладельца", Неопределено, "Месяц", Ложь),
		ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийМесяцУдержанияСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийМесяцУдержанияСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Элементы.ГрафикУдержаний.ТекущиеДанные.МесяцУдержания", "Элементы.ГрафикУдержаний.ТекущиеДанные.МесяцУдержанияСтрокой", Направление);
	Объект.ГрафикУдержаний.Сортировать("МесяцУдержания");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтправляемыеДанные

&НаКлиенте
Процедура ОтправляемыеДанныеСпособПроверкиЗаполненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтправляемыеДанные.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьСпособПроверкиЗаполнения(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтправляемаяКонтактнаяИнформация

&НаКлиенте
Процедура ОтправляемаяКонтактнаяИнформацияСпособПроверкиЗаполненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтправляемаяКонтактнаяИнформация.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьСпособПроверкиЗаполнения(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтправляемыеДополнительныеРеквизитыИСведения

&НаКлиенте
Процедура ОтправляемыеДополнительныеРеквизитыИСведенияСпособПроверкиЗаполненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтправляемыеДополнительныеРеквизитыИСведения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьСпособПроверкиЗаполнения(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
// 
// Параметры:
//  ЭлементИлиКоманда	- ПолеФормы
//  					- КомандаФормы
//  НавигационнаяСсылка - Неопределено - Навигационная ссылка
//  СтандартнаяОбработка - Булево - Стандартная обработка
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ПодборПрограммМедицинскогоСтрахования(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("СтраховаяКомпания", Объект.Владелец);
	ПараметрыФормы.Вставить("АдресСпискаПодобранных", АдресСпискаПодобранныхПрограмм());
	
	ОткрытьФорму("Справочник.ПрограммыМедицинскогоСтрахования.Форма.ФормаВыбора",
		ПараметрыФормы, Элементы.ПрограммыМедицинскогоСтрахования);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПодборРасширенийМедицинскогоСтрахования(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("СтраховаяКомпания", Объект.Владелец);
	ПараметрыФормы.Вставить("АдресСпискаПодобранных", АдресСпискаПодобранныхРасширений());
	
	ОткрытьФорму("Справочник.РасширенияПрограммМедицинскогоСтрахования.Форма.ФормаВыбора",
		ПараметрыФормы, Элементы.РасширенияПрограммМедицинскогоСтрахования);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьРасширенияСтрахования()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРасширенияСтрахования", "Видимость", Объект.ИспользуютсяРасширенияПрограмм); 
		
КонецПроцедуры

// Возвращает адрес во временном хранилище массива уже подобранных программ.
&НаСервере
Функция АдресСпискаПодобранныхПрограмм()
	
	Программы = Объект.ПрограммыМедицинскогоСтрахования.Выгрузить(, "Программа").ВыгрузитьКолонку("Программа");
	
	Возврат ПоместитьВоВременноеХранилище(Программы, УникальныйИдентификатор);
	
КонецФункции

// Возвращает адрес во временном хранилище массива уже подобранных расширений программ.
&НаСервере
Функция АдресСпискаПодобранныхРасширений()
	
	Расширения = Объект.РасширенияПрограммМедицинскогоСтрахования.Выгрузить(, "РасширениеСтрахования").ВыгрузитьКолонку("РасширениеСтрахования");
	
	Возврат ПоместитьВоВременноеХранилище(Расширения, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ЗаполнитьОтправляемыеДанные();
	ЗаполнитьОтправляемуюКонтактнуюИнформацию();
	ЗаполнитьОтправляемыеДополнительныеРеквизитыИСведения();
	
	ДобавитьСтрокиШкалыВозраста(Объект.ШкалаВозрастаДляСотрудников);
	ДобавитьСтрокиШкалыВозраста(Объект.ШкалаВозрастаДляРодственников);
	СформироватьПредставлениеИнтервалаШкалыВозраста(Объект.ШкалаВозрастаДляСотрудников);
	СформироватьПредставлениеИнтервалаШкалыВозраста(Объект.ШкалаВозрастаДляРодственников);
	
	УстановитьВидимостьНастроекУдержания(ЭтотОбъект, ОбщегоНазначения);
	
	УстановитьВидимостьРасширенияСтрахования();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтправляемыеДанные()
	
	Для Каждого Сведение Из Перечисления.ДанныеЗастрахованных Цикл
		ПараметрыОтбора = Новый Структура("Сведение", Сведение);
		НайденныеСведения = Объект.ОтправляемыеДанные.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСведения.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.ОтправляемыеДанные.Добавить();
		НоваяСтрока.Сведение = Сведение;
		НоваяСтрока.Отправлять = Истина;
		НоваяСтрока.СпособПроверкиЗаполнения = Перечисления.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять;
	КонецЦикла;
	
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьОтправляемуюКонтактнуюИнформацию()
	
	ТаблицаВидовКИ = УправлениеКонтактнойИнформацией.ВидыКонтактнойИнформацииОбъекта(
		Справочники.ФизическиеЛица.ПустаяСсылка());//@skip-check invocation-parameter-type-intersect
	ВидыКонтактнойИнформацииФизическихЛиц.ЗагрузитьЗначения(ТаблицаВидовКИ.ВыгрузитьКолонку("Ссылка"));
	
	Для Каждого ВидКИ Из ВидыКонтактнойИнформацииФизическихЛиц Цикл
		ЗначениеВидаКИ = ВидКИ.Значение; // СправочникСсылка.ВидыКонтактнойИнформации
		ПараметрыОтбора = Новый Структура("ВидКонтактнойИнформации", ЗначениеВидаКИ);
		НайденныеСведения = Объект.ОтправляемаяКонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСведения.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.ОтправляемаяКонтактнаяИнформация.Добавить();
		НоваяСтрока.ВидКонтактнойИнформации = ЗначениеВидаКИ;
		НоваяСтрока.Отправлять = Ложь;
		НоваяСтрока.СпособПроверкиЗаполнения =
			Перечисления.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтправляемыеДополнительныеРеквизитыИСведения()
	
	Если Не ИспользоватьДополнительныеРеквизитыИСведения Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СвойстваДоступны Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваФизическихЛиц.ЗагрузитьЗначения(
		УправлениеСвойствами.СвойстваОбъекта(Справочники.ФизическиеЛица.ПустаяСсылка()));
	
	Для Каждого Свойство Из СвойстваФизическихЛиц Цикл
		ЗначениеСвойства = Свойство.Значение; // ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения
		ПараметрыОтбора = Новый Структура("Сведение", ЗначениеСвойства);
		НайденныеСведения = Объект.ОтправляемыеДополнительныеРеквизитыИСведения.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСведения.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.ОтправляемыеДополнительныеРеквизитыИСведения.Добавить();
		НоваяСтрока.Сведение = ЗначениеСвойства;
		НоваяСтрока.Отправлять = Ложь;
		НоваяСтрока.СпособПроверкиЗаполнения =
			Перечисления.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "Объект.ШкалаВозрастаДляСотрудников.ЗначениеОт", , ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра(
		"Текст", Новый ПолеКомпоновкиДанных("Объект.ШкалаВозрастаДляСотрудников.ПредставлениеОт"));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ШкалаВозрастаДляСотрудниковЗначениеОт");
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "Объект.ШкалаВозрастаДляСотрудников.ЗначениеДо", , ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра(
		"Текст", Новый ПолеКомпоновкиДанных("Объект.ШкалаВозрастаДляСотрудников.ПредставлениеДо"));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ШкалаВозрастаДляСотрудниковЗначениеДо");
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "Объект.ШкалаВозрастаДляРодственников.ЗначениеОт", , ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра(
		"Текст", Новый ПолеКомпоновкиДанных("Объект.ШкалаВозрастаДляРодственников.ПредставлениеОт"));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ШкалаВозрастаДляРодственниковЗначениеОт");
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "Объект.ШкалаВозрастаДляРодственников.ЗначениеДо", , ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра(
		"Текст", Новый ПолеКомпоновкиДанных("Объект.ШкалаВозрастаДляРодственников.ПредставлениеДо"));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ШкалаВозрастаДляРодственниковЗначениеДо");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьНастроекУдержания(Форма, МодульОбщегоНазначения)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Если Не Форма.ИспользуютсяУдержания Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СпособУдержанияМедицинскогоСтрахования.Видимость = Объект.ТребуетсяУдержание;
	Элементы.Удержание.Видимость = Объект.ТребуетсяУдержание;
	Элементы.ГруппаУдерживатьПоУмолчанию.Видимость = Объект.ТребуетсяУдержание;
	Элементы.ПрименяетсяЧастичноеУдержание.Видимость = Объект.ТребуетсяУдержание;
	Элементы.ПроцентЧастичногоУдержания.Видимость = Объект.ТребуетсяУдержание;
	Элементы.ГруппаГрафикУдержаний.Видимость = Объект.ТребуетсяУдержание И Объект.СпособУдержания =
		МодульОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику");
	УстановитьВидимостьНастроекЧастичногоУдержания(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьНастроекЧастичногоУдержания(Форма)
	
	Форма.Элементы.ПроцентЧастичногоУдержания.Доступность =
		Форма.Объект.ПрименяетсяЧастичноеУдержание И Форма.Объект.ТребуетсяУдержание;
	
КонецПроцедуры

// Обработать способ проверки заполнения.
// 
// Параметры:
//  ТекущиеДанные - ДанныеФормыЭлементКоллекции:
//	 * СпособПроверкиЗаполнения - ПеречислениеСсылка.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования
&НаКлиенте
Процедура ОбработатьСпособПроверкиЗаполнения(ТекущиеДанные)
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СпособПроверкиЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.СпособПроверкиЗаполнения = 
		ПредопределенноеЗначение("Перечисление.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять");
	
КонецПроцедуры

// Ввод месяца удержания начало выбора завершение.
// 
// Параметры:
//  ВыбранноеЗначение	- Дата
//  					- Неопределено
//  ДополнительныеПараметры - Структура
&НаКлиенте
Процедура ВводМесяцаУдержанияНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ГрафикУдержаний.ТекущаяСтрока; // Число
	СтрокаГрафика = Объект.ГрафикУдержаний.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаГрафика.МесяцУдержания = ВыбранноеЗначение;
	СтрокаГрафика.МесяцУдержанияСтрокой = Формат(ВыбранноеЗначение, НСтр("ru='ДФ=''ММММ гггг'''"));
	
	Объект.ГрафикУдержаний.Сортировать("МесяцУдержания");
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Подключаемый при изменении дополнительного реквизита.
// 
// Параметры:
//  Элемент - ПолеФормы
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область ШкалаВозраста

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеИнтервалаШкалыВозраста(ТаблицаИнтервалов)
	
	Для Каждого СтрокаШкалы Из ТаблицаИнтервалов Цикл
		МедицинскоеСтрахованиеКлиентСервер.СформироватьПредставлениеИнтервалаШкалыВозраста(СтрокаШкалы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УпорядочитьСтрокиШкалыВозраста(ТекущиеДанные, Шкала)
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущаяПозиция = Шкала.Индекс(ТекущиеДанные);
	НоваяПозиция = 0;
	
	Для Каждого ТекСтрока Из Шкала Цикл 
		Если НоваяПозиция <> ТекущаяПозиция И ТекСтрока.ЗначениеОт >= ТекущиеДанные.ЗначениеОт Тогда 
			Прервать;
		КонецЕсли;
		НоваяПозиция = НоваяПозиция + 1;
	КонецЦикла;
	
	Сдвиг = ?(НоваяПозиция < ТекущаяПозиция, НоваяПозиция - ТекущаяПозиция, НоваяПозиция - ТекущаяПозиция - 1);
	Шкала.Сдвинуть(ТекущаяПозиция, Сдвиг);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСтрокиШкалыВозраста(Шкала)
	
	КоличествоСтрок = Шкала.Количество();
	Если КоличествоСтрок = 0 Тогда 
		НоваяСтрока = Шкала.Добавить();
		НоваяСтрока.ЗначениеПоказателя = 1;
	ИначеЕсли Шкала[КоличествоСтрок-1].ЗначениеДо <> 0 
		И Шкала[КоличествоСтрок-1].ЗначениеДо > Шкала[КоличествоСтрок-1].ЗначениеОт Тогда
		НоваяСтрока = Шкала.Добавить();
		НоваяСтрока.ЗначениеОт = Шкала[КоличествоСтрок-1].ЗначениеДо + 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьСоседниеСтрокиШкалыВозраста(ТекущиеДанные, Шкала);
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЗначениеДо <= ТекущиеДанные.ЗначениеОт Тогда
		ТекущиеДанные.ЗначениеДо = 0;
		Возврат;
	КонецЕсли;
	
	КоличествоСтрок = Шкала.Количество();
	ИндексСтроки = Шкала.Индекс(ТекущиеДанные);
	
	Если ИндексСтроки = (КоличествоСтрок - 1) Тогда 
		Возврат;
	КонецЕсли;
	
	СледующаяСтрока = Шкала[ИндексСтроки+1];
	СледующаяСтрока.ЗначениеОт = ТекущиеДанные.ЗначениеДо + 1;
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьИнтервалыШкалыВозраста(Шкала)
	
	НижняяГраница = Неопределено;
	КоличествоСтрок = Шкала.Количество();
	
	Для Сч = 1 По КоличествоСтрок Цикл 
		ИндексСтроки = КоличествоСтрок - Сч;
		ТекСтрока = Шкала[ИндексСтроки];
		
		Если НижняяГраница <> Неопределено И НижняяГраница <> ТекСтрока.ЗначениеДо + 1 Тогда 
			ТекСтрока.ЗначениеДо = НижняяГраница - 1;
		КонецЕсли;
		
		Если НижняяГраница = Неопределено И ТекСтрока.ЗначениеОт = ТекСтрока.ЗначениеДо Тогда 
			ТекСтрока.ЗначениеДо = 0;
		КонецЕсли;
		
		Если (ТекСтрока.ЗначениеОт > ТекСтрока.ЗначениеДо И ТекСтрока.ЗначениеДо <> 0) 
			Или (ТекСтрока.ЗначениеОт = ТекСтрока.ЗначениеДо И ТекСтрока.ЗначениеОт <> 0) Тогда
			Шкала.Удалить(ТекСтрока);
			Продолжить;
		КонецЕсли;
		
		НижняяГраница = ТекСтрока.ЗначениеОт;
	КонецЦикла;
	
	// В первой строке может быть нулевое значение До, только если это единственная строка.
	Пока Шкала.Количество() > 1 Цикл 
		Если Шкала[0].ЗначениеДо <> 0 Тогда 
			Прервать;
		КонецЕсли;
		Шкала.Удалить(0);
	КонецЦикла;
	
	СформироватьПредставлениеИнтервалаШкалыВозраста(Шкала);
	
КонецПроцедуры

#КонецОбласти
